package util;

public class CityGenerator {
    private static final String city = "Майкоп,\n" +
            "Горно-Алтайск,\n" +
            "Уфа, \n" +
            "Улан-Удэ, \n" +
            "Махачкала,\n" +
            "Магас,\n" +
            "Нальчик, \n" +
            "Элиста, \n" +
            "Черкесск, \n" +
            "Петрозаводск, \n" +
            "Сыктывкар, \n" +
            "Симферополь, \n" +
            "Йошкар-Ола, \n" +
            "Саранск, \n" +
            "Якутск,\n" +
            "Владикавказ,\n" +
            "Казань, \n" +
            "Кызыл, \n" +
            "Ижевск, \n" +
            "Абакан, \n" +
            "Грозный,\n" +
            "Чебоксары, \n" +
            "Барнаул, \n" +
            "Чита, \n" +
            "Петропавловск-Камчатский, \n" +
            "Краснодар, \n" +
            "Красноярск,\n" +
            "Пермь, \n" +
            "Владивосток,\n" +
            "Ставрополь, \n" +
            "Хабаровск, \n" +
            "Благовещенск,\n" +
            "Архангельск,\n" +
            "Астрахань,\n" +
            "Белгород,\n" +
            "Брянск,\n" +
            "Владимир,\n" +
            "Волгоград,\n" +
            "Вологда,\n" +
            "Воронеж,\n" +
            "Иваново,\n" +
            "Иркутск,\n" +
            "Калининград,\n" +
            "Калуга,\n" +
            "Кемерово,\n" +
            "Киров,\n" +
            "Кострома,\n" +
            "Курган,\n" +
            "Курск,\n" +
            "Липецк,\n" +
            "Магадан,\n" +
            "Мурманск,\n" +
            "Нижний Новгород,\n" +
            "Великий Новгород, \n" +
            "Новосибирск, \n" +
            "Омск,\n" +
            "Оренбург,\n" +
            "Орёл,\n" +
            "Пенза,\n" +
            "Псков,\n" +
            "Ростов-на-Дону,\n" +
            "Рязань,\n" +
            "Самара,\n" +
            "Саратов,\n" +
            "Южно-Сахалинск,\n" +
            "Екатеринбург, \n" +
            "Смоленск,\n" +
            "Тамбов, \n" +
            "Тверь, \n" +
            "Томск,\n" +
            "Тула, \n" +
            "Тюмень,\n" +
            "Ярославль,\n" +
            "Москва,\n" +
            "Санкт-Петербург,\n" +
            "Севастополь,\n" +
            "Биробиджан,\n" +
            "Нарьян-Мар,\n" +
            "Ханты-Мансийск,\n" +
            "Анадырь,\n" +
            "Салехард";

    public static String getRandomCity(){
        String[] cities = city.split(",");
        int max = cities.length;
        int min = 0;
        max -= min;
        int randomInt = (int) (Math.random() * ++max) + min;
        return cities[randomInt].trim();
    }
}
